Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateNewDesignOption Property
 Cannot create a new empty design option
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateNewDesignOption { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateNewDesignOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateNewDesignOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace